# tic-tac-toe game for SkillFactory B5.6
helloText = """
***********************************************************************************************
*                                                                                             *
*     *******   *   *   *        *******     *      *    *        *******   ***    * * *      *
*        *      *   *  *            *       * *     *  *             *     *   *   *          *
*        *      *   * *    ****     *      * * *    * *     ****     *     *   *   * * *      *
*        *      *   *  *            *     *     *   *  *             *     *   *   *          *
*        *      *   *   *           *    *       *  *    *           *      ***    * * *      *
*                                                                                             *
***********************************************************************************************"""
gameRulesText = """
    Правила игры:
    Игроки поочередно вводят координаты клеток в формате X,Y (строка, столбец) и таким образом
    ставят на свободные клетки поля 3×3 знаки (один всегда крестики, другой всегда нолики).
    Первый, выстроивший в ряд 3 своих фигуры по вертикали, горизонтали или большой диагонали,
    выигрывает. Первый ходит крестик - 'X'."""
gameDesk = [[" ", " ", " "] for i in range(0, 3)]

#print(helloText)
#print(gameRulesText)
#input("\n               Нажмите 'Enter' чтобы продолжить...")


def drawGameDesk(gameDesk_):
    print()
    print("     |  " + "  |  ".join("012") + "  |")
    print("-----|" * 4)
    for i in range(0, 3):
        print(f"  {i}  |", end='')
        for j in range(0, 3):
            print(f"  {gameDesk_[i][j]}  |", end='')
        print("\n" + "-----|" * 4)
    print()



def nextTurn():
    x, y = input("Введите координаты клетки в формате  X,Y (строка, столбец): ")



for turn in range(0, 9):
    print("\033[H\033[J")
    if turn % 2:
        print("Ходит 'нолик'...")
    else:
        print("Ходит 'крестик'...")

    drawGameDesk(gameDesk)
    nextTurn()

