# tic-tac-toe game for SkillFactory B5.6
helloText = """\n
***********************************************************************************************
*                                                                                             *
*      *******   *   *   *        *******     *      *    *        *******   ***   * * *      *
*         *      *   *  *            *       * *     *  *             *     *   *  *          *
*         *      *   * *    ****     *      * * *    * *     ****     *     *   *  * * *      *
*         *      *   *  *            *     *     *   *  *             *     *   *  *          *
*         *      *   *   *           *    *       *  *    *           *      ***   * * *      *
*                                                                                             *
***********************************************************************************************"""
gameRulesText = """
    Правила игры:
    Игроки поочередно вводят координаты клеток в формате X,Y (строка, столбец) и таким образом
    ставят на свободные клетки поля 3×3 знаки (один всегда крестики, другой всегда нолики).
    Первый, выстроивший в ряд 3 своих фигуры по вертикали, горизонтали или большой диагонали,
    выигрывает. Первый ходит крестик - 'X'."""


print(helloText)
print(gameRulesText)

